Revit.Transaction.Transaction
A Revit Transaction.

Revit.Transaction.Transaction.Start(System.Object)
Start a transaction if neccesssary, returning
whatever was passed in.
input:
Returns:

Revit.Transaction.Transaction.End(System.Object)
Ends the current Dynamo transaction, returning whatever was
passed in.
input: An object.